In [1]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('test.db', check_same_thread=False)

In [42]:
query= """CREATE TABLE ExpenseMaster        
           (    request_id INTEGER PRIMARY KEY AUTOINCREMENT,
                Expensetype varchar(255),
                company_name varchar(255),
                Description varchar(255),
                Amount_requested varchar(255),
                Amount_approved varchar(255),
                userID varchar(255),
                userName varchar(255),
                date varchar(255),
                STATUS varchar(255),
                updatedBY varchar(255))"""
conn.execute("drop table if exists  ExpenseMaster ")
conn.commit()
conn.execute(query)
conn.commit()

In [26]:
stmt = "SELECT * from ExpenseMaster "
cursor = conn.execute(stmt)
equipment_list = []
for row in cursor:
    print(row)

(1, 'Travel', 'Uni Medicolabs', 'af', '213', '', 'analyst', 'analyst analyst', '2022-08-13 22:42:38', 'REQUESTED', '')

In [7]:
sql_create_table_query = """
CREATE TABLE file_db (name varchar(255) , data BLOB);
"""
conn.execute("drop table if exists  file_db ")
conn.commit()
conn.execute(sql_create_table_query)
conn.commit()

In [ ]:
stmt = "SELECT * from equipment_master "
cursor = conn.execute(stmt)
equipment_list = []
for row in cursor:

In [ ]:
conn.execute(sql_create_table_query)

In [125]:
equipment_master.columns.tolist()

['sr.no',
 'Type',
 'EQUIPMENT_NAME',
 'MAKE',
 'MODEL_NUMBER',
 'SR_NO_ID',
 'DONE_DATE',
 'DUE_DATE']

In [126]:
# query = """INSERT INTO USERS ( USERNAME , ROLE, PASSWORD)
#                          VALUES ( '{}','{}','{}')""".format(username,role,password)
# print(query)
# conn.execute(query)
query= """CREATE TABLE equipment_master        
           (    Type varchar(255),
                EQUIPMENT_NAME varchar(255),
                MAKE varchar(255),
                MODEL_NUMBER varchar(255),
                SR_NO_ID varchar(255),
                DONE_DATE varchar(255),
                DUE_DATE varchar(255),
                STATUS varchar(255),
                ISSUED_TO varchar(255),
                COMPANY_NAME varchar(255),
                REMARK varchar(255))"""
conn.execute("drop table if exists  equipment_master ")
conn.commit()
conn.execute(query)
conn.commit()
stmt = "SELECT * from equipment_master "
cursor = conn.execute(stmt)
for row in cursor:
    print(row)

In [127]:
for row in equipment_master.itertuples():
    query = """INSERT INTO equipment_master 
            (Type ,EQUIPMENT_NAME ,MAKE ,MODEL_NUMBER,SR_NO_ID ,DONE_DATE ,DUE_DATE,STATUS,ISSUED_TO,COMPANY_NAME ,REMARK) 
            VALUES ( '{}','{}','{}','{}','{}','{}','{}','{}','{}','{}',"{}")""".format(row[2],row[3],row[4],row[5],row[6],row[7],row[8],"AVAILABLE","","","")
    #print(query)
    conn.execute(query)
    conn.commit()
    
stmt = "SELECT * from equipment_master "
cursor = conn.execute(stmt)
equipment_list = []
for row in cursor:
    equipment_list.append(list(row))
equipment_frame = pd.DataFrame(equipment_list)
equipment_frame.columns = ['Type' ,'EQUIPMENT_NAME' ,'MAKE' ,'MODEL_NUMBER','SR_NO_ID' ,'DONE_DATE' ,'DUE_DATE','STATUS','ISSUED_TO','COMPANY_NAME' ,'REMARK']
equipment_frame

,Type,EQUIPMENT_NAME,MAKE,MODEL_NUMBER,SR_NO_ID,DONE_DATE,DUE_DATE,STATUS,ISSUED_TO,COMPANY_NAME,REMARK
0,AIR_VELOCITY,VANE TYPE ANEMOETER,METRAVI,AVM-04,S12K240201,2021-09-11 00:00:00,2021-09-11 00:00:00,AVAILABLE,,,
1,AIR_VELOCITY,VANE TYPE ANEMOETER,INDI,3145,S12K160162,2022-09-11 00:00:00,2022-09-11 00:00:00,AVAILABLE,,,
2,AIR_VELOCITY,VANE TYPE ANEMOETER,HSTENI,HT-9819,202003305488,2021-04-10 00:00:00,2022-03-10 00:00:00,AVAILABLE,,,
3,AIR_VELOCITY,VANE TYPE ANEMOETER,METRAVI,AVM-10,200616197,2024-09-11 00:00:00,2024-09-11 00:00:00,AVAILABLE,,,
4,PAO_TEST,Aerosol Photometer,TEC Service,PH-5,2829,13/01/2022,13/01/2023,AVAILABLE,,,
5,PAO_TEST,Aerosol Photometer,TEC Service,PH-5,3690,26/03/2021,26/03/2022,AVAILABLE,,,
6,PARTICLE_COUNT,Partical Counter,TSI,9500-01,95001809003,13/01/2022,13/01/2023,AVAILABLE,,,
7,PARTICLE_COUNT,Partical Counter,TSI,9350-03,93502030005,13/01/2022,13/01/2023,AVAILABLE,,,

## ELOGBOOK

In [39]:
query= """CREATE TABLE elogbook        
           (    
                SR_NO_ID varchar(255),
                STATUS varchar(255),
                ISSUED_TO varchar(255),
                COMPANY_NAME varchar(255),
                REMARK varchar(255),
                update_time varchar(255))"""
conn.execute("drop table if exists  elogbook ")
conn.commit()
conn.execute(query)
conn.commit()

In [129]:
# query="""INSERT INTO elogbook
#                     (SR_NO_ID ,STATUS,ISSUED_TO ,COMPANY_NAME , REMARK ,update_time)
#                     VALUES ( '202003305488','REQUESTED','analyst','bm','bmn')"""
# conn.execute(query)
# conn.commit()
# stmt = "SELECT * from elogbook "
# cursor = conn.execute(stmt)
# for row in cursor:
#     print(row)

In [130]:
# stmt = "SELECT USERNAME,ROLE,PASSWORD from USERS "
# cursor = conn.execute(stmt)
# for row in cursor:
#     print(row)
# username ="Ajeet"
# role ="Admin"
# password ="123"

# query = """INSERT INTO USERS ( USERNAME , ROLE, PASSWORD)
#                          VALUES ( '{}','{}','{}')""".format(username,role,password)
# print(query)
# conn.execute(query)

In [132]:
# company_details = pd.read_excel("static\\inputData\\company_details.xlsx")
# company_details.columns.tolist()


# query= """CREATE TABLE company_details        
#            (    
#                 COMPANY_NAME varchar(255),
#                 ADDRESS varchar(255),
#                 REPORT_NUMBER varchar(255))"""
# conn.execute("drop table if exists  company_details ")
# conn.commit()
# conn.execute(query)
# conn.commit()

# for row in company_details.itertuples():
#     query = """INSERT INTO company_details 
#             ('COMPANY_NAME', 'ADDRESS', 'REPORT_NUMBER') 
#             VALUES ( '{}','{}','{}')""".format(row[1],row[2],row[3])
#     #print(query)
#     conn.execute(query)
#     conn.commit()
    
# stmt = "SELECT * from company_details "
# cursor = conn.execute(stmt)
# equipment_list = []
# for row in cursor:
#     equipment_list.append(list(row))
# equipment_frame = pd.DataFrame(equipment_list)
# equipment_frame.columns = ['COMPANY_NAME', 'ADDRESS', 'REPORT_NUMBER']
# equipment_frame

In [40]:
query = """delete from  USERS"""
conn.execute(query)
conn.commit()

In [41]:
query= """CREATE TABLE USERS(USERNAME VARCHAR(30),FNAME VARCHAR(30),LNAME VARCHAR(30),
                ROLE VARCHAR(15), PASSWORD VARCHAR(64) ,EMAILID VARCHAR(64),STATUS VARCHAR(64))"""
conn.execute("drop table if exists  USERS ")
conn.commit()
conn.execute(query)
conn.commit()


conn.execute("""INSERT INTO USERS (USERNAME,FNAME,LNAME,ROLE,PASSWORD,EMAILID,STATUS)
             VALUES ('admin', 'admin','admin', 'admin', '205f0f3ff2d9531c54cb61ceb7bed9db11cb7a9a56b654d8d1efc6982f50122e',"pinpointengineers@hotmail.com" ,'ACTIVE')""")
conn.commit()
print('[+] Admin user created')
conn.execute("""INSERT INTO USERS (USERNAME,FNAME,LNAME,ROLE,PASSWORD,EMAILID,STATUS)
             VALUES ('analyst', 'analyst', 'analyst', 'analyst', '166b29b136583748cdeda22b3abeb11aecc60d8d2fd0b9046011b31cebc0fdc4',"pinpointengineers@hotmail.com" ,'ACTIVE')""")
conn.commit()

stmt = "SELECT * from USERS "
cursor = conn.execute(stmt)
for row in cursor:
    print(row)

[+] Admin user created
('admin', 'admin', 'admin', 'admin', '205f0f3ff2d9531c54cb61ceb7bed9db11cb7a9a56b654d8d1efc6982f50122e', 'pinpointengineers@hotmail.com', 'ACTIVE')
('analyst', 'analyst', 'analyst', 'analyst', '166b29b136583748cdeda22b3abeb11aecc60d8d2fd0b9046011b31cebc0fdc4', 'pinpointengineers@hotmail.com', 'ACTIVE')

In [33]:
stmt = "SELECT * from USERS "
cursor = conn.execute(stmt)
for row in cursor:
    print(row)

('admin', 'admin', 'admin', 'admin', '205f0f3ff2d9531c54cb61ceb7bed9db11cb7a9a56b654d8d1efc6982f50122e', 'pinpointengineers@hotmail.com', 'ACTIVE')
('analyst', 'analyst', 'analyst', 'analyst', '166b29b136583748cdeda22b3abeb11aecc60d8d2fd0b9046011b31cebc0fdc4', 'pinpointengineers@hotmail.com', 'ACTIVE')